# Analyze Correlation Exists Between Movies Revenue its Budget

## Data Exploration and Data Cleaning

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/cost_revenue_dirty.csv')
df.sample(n=10)

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
1957,917,1/8/2003,American Wedding,"$55,000,000","$126,425,115","$104,354,205"
120,4254,7/4/1965,Major Dundee,"$3,800,000","$14,873","$14,873"
5324,1863,2/24/2017,Collide,"$29,200,000","$5,278,519","$2,280,004"
4014,4867,10/21/2011,Martha Marcy May Marlene,"$1,000,000","$5,438,911","$2,981,038"
5136,2145,1/29/2016,Jane Got a Gun,"$25,000,000","$2,976,636","$1,513,793"
4336,5199,2/8/2013,The Canyons,"$250,000","$62,375","$59,671"
3091,1312,2/22/2008,Vantage Point,"$40,000,000","$150,886,329","$72,266,306"
456,1779,12/19/1986,Little Shop of Horrors,"$30,000,000","$38,747,385","$38,747,385"
476,2213,7/17/1987,Jaws 4: The Revenge,"$23,000,000","$15,728,335","$15,728,335"
3526,4035,12/6/2009,Moon,"$5,000,000","$10,676,073","$5,010,163"

In [3]:
print(f'The shape: {df.shape}')
print(f'The column names: {df.columns}')

The shape: (5391, 6)
The column names: Index(['Rank', 'Release_Date', 'Movie_Title', 'USD_Production_Budget',
       'USD_Worldwide_Gross', 'USD_Domestic_Gross'],
      dtype='object')

Are there any NaN values, check the datatype of each column, are there any duplicated entries.

In [4]:
df.isna().any()

Rank                     False
Release_Date             False
Movie_Title              False
USD_Production_Budget    False
USD_Worldwide_Gross      False
USD_Domestic_Gross       False
dtype: bool

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5391 entries, 0 to 5390
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   5391 non-null   int64
 1   Release_Date           5391 non-null   object
 2   Movie_Title            5391 non-null   object
 3   USD_Production_Budget  5391 non-null   object
 4   USD_Worldwide_Gross    5391 non-null   object
 5   USD_Domestic_Gross     5391 non-null   object
dtypes: int64(1), object(5)
memory usage: 252.8+ KB

In [6]:
df.duplicated(subset=['Release_Date', 'Movie_Title']).any()

True

There are duplicated entries in the `Release_Date` and `Movie_Title` subset.

Let's see what they are?

In [7]:
df[df.duplicated(subset=['Release_Date', 'Movie_Title'])]

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
3055,5290,12/31/2007,A Dog's Breakfast,"$120,000",$0,$0

So there are two entries for `A Dog's Breakfast`.

Let's remove one.

In [8]:
df = df.drop_duplicates(subset=['Release_Date', 'Movie_Title'])
df.duplicated(subset=['Release_Date', 'Movie_Title']).any()

False

Now that we have removed duplicates and checked there are no NaN values in our DataFrame. What else can we do next?

* Change the dtype of `USD_Production_Budget`, `USD_Worldwide_Gross` and `USD_Domestic_Gross` to numerical data type.
* Change the `Release_Date` into datetime data type.

In [11]:
cols_to_repl = ['USD_Production_Budget', 'USD_Worldwide_Gross', 'USD_Domestic_Gross']
chars_to_repl = ['$', ',']

for col in cols_to_repl:
    for char in chars_to_repl:
        df[col] = df[col].str.replace(char, '', regex=False)
    df[col] = pd.to_numeric(df[col])

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5390 entries, 0 to 5390
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   5390 non-null   int64
 1   Release_Date           5390 non-null   object
 2   Movie_Title            5390 non-null   object
 3   USD_Production_Budget  5390 non-null   int64
 4   USD_Worldwide_Gross    5390 non-null   int64
 5   USD_Domestic_Gross     5390 non-null   int64
dtypes: int64(4), object(2)
memory usage: 294.8+ KB

In [13]:
df['Release_Date'] = pd.to_datetime(df['Release_Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5390 entries, 0 to 5390
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   5390 non-null   int64
 1   Release_Date           5390 non-null   datetime64[ns]
 2   Movie_Title            5390 non-null   object
 3   USD_Production_Budget  5390 non-null   int64
 4   USD_Worldwide_Gross    5390 non-null   int64
 5   USD_Domestic_Gross     5390 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 294.8+ KB

In [14]:
df.sample(n=20)

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
1367,1306,1999-12-24,The Talented Mr. Ripley,40000000,128792135,81292135
2458,2396,2005-07-10,2 For the Money,20000000,30491379,22991379
1075,4062,1998-03-27,No Looking Back,5000000,143273,143273
5244,3356,2016-09-16,Blair Witch,10000000,37493221,20777061
2167,3037,2004-01-23,The Butterfly Effect,13000000,95638592,57924679
3623,3434,2010-04-16,The Joneses,10000000,3541565,1475746
1161,3158,1998-11-09,Rounders,12000000,22921898,22921898
1483,3309,2000-08-25,Bring it On,10000000,90453550,68353550
4148,3858,2012-04-27,Bernie,6000000,10106975,9204489
1648,4534,2001-07-13,Bully,2100000,1381824,881824
3556,2362,2010-01-09,The American,20000000,67950723,35606376
1609,629,2001-04-27,Driven,72000000,54616869,32616869
1488,1596,2000-09-15,Bait,35000000,15471969,15325127
1733,630,2001-12-21,The Majestic,72000000,37306334,27796042
4054,406,2011-12-20,The Girl with the Dragon Tattoo,90000000,239373970,102515793
4414,5084,2013-06-28,Detention of the Dead,500000,1778,1778
4898,3315,2015-05-06,Insidious Chapter 3,10000000,120678444,52218558
1379,5358,2000-01-14,The Terrorist,25000,195043,195043
2028,4830,2003-05-14,Dracula: Pages from a Virgin's Diary,1100000,81371,39659
1992,949,2003-03-14,The Hunted,55000000,47213095,34234008